---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ITransactionFinalizer
source: html/87592bcd-a941-bc0a-b90c-b5bcd5fff098.htm
---
# ITransactionFinalizer Members

This method is called at the end of committing a transaction